Autodesk.Revit.DB.Structure.TargetRebarEdge.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.TargetRebarEdge.TargetEdgeIndex
Identifies the index of the target Rebar's edge.
The index is a number between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
Since:
2027

Autodesk.Revit.DB.Structure.TargetRebarEdge.TargetRebarId
Identifies the id of the target Rebar.
Since:
2027

Autodesk.Revit.DB.Structure.TargetRebarEdge.#ctor(Autodesk.Revit.DB.Structure.Rebar,System.Int32)
Constructs a new instance of TargetRebarEdge.
targetRebar:
The target Rebar.
targetEdgeIndex:
Identifies the index of the target Rebar's edge.
The index should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in the target set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
targetEdgeIndex is not a valid edge index for the rebar. It should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
Since:
2027

Autodesk.Revit.DB.Structure.TargetRebarEdge
This class is used to identify the target edge of a 'ToOtherRebar' RebarConstraint.
Since:
2027